Revit 2027 API
Wood Class
 A static class that provides access to the property names that appear in the Wood visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Wood
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Wood
Public NotInheritable Class Wood
public ref class Wood abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Wood = class end
The Wood type exposes the following members.
Properties
Name | Description
TextureAngle |  The property labeled "Angle" from the "Wood" schema.
TextureLinkTextureTransforms |  The property labeled "Link Transforms" from the "Wood" schema.
TextureRealWorldOffsetX |  The property labeled "Offset X" from the "Wood" schema.
TextureRealWorldOffsetY |  The property labeled "Offset Y" from the "Wood" schema.
TextureRealWorldOffsetZ |  The property labeled "Offset Z" from the "Wood" schema.
WoodAxialNoise |  The property labeled "Axial Noise" from the "Wood" schema.
WoodColor1 |  The property labeled "Color 1" from the "Wood" schema.
WoodColor2 |  The property labeled "Color 2" from the "Wood" schema.
WoodRadialNoise |  The property labeled "Radial Noise" from the "Wood" schema.
WoodThickness |  The property labeled "Grain Thickness" from the "Wood" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace